# Challenge Set 9
## Part III: Soccer Data

*Introductory - Intermediate level SQL*

--

Please complete this exercise using sqlite3 and Jupyter notebook.

Download the [SQLite database](https://www.kaggle.com/hugomathien/soccer/downloads/soccer.zip) and load in your notebook using the sqlite3 library.

In [16]:
import sqlite3
import pandas as pd

In [11]:
# Load the database and create connection
conn = sqlite3.connect('database.sqlite')
c=conn.cursor()

# Check what tables this database contains
sql_command = '''SELECT name FROM sqlite_master WHERE type='table';'''
c.execute(sql_command)
result = c.fetchall()
print(result)

[('sqlite_sequence',), ('Player_Attributes',), ('Player',), ('Match',), ('League',), ('Country',), ('Team',), ('Team_Attributes',)]

In [19]:
sql_query= '''
            SELECT * FROM Player_Attributes
            LIMIT 5;
           '''
pd.read_sql_query(sql_query, conn)

,id,player_fifa_api_id,player_api_id,date,overall_rating,potential,preferred_foot,attacking_work_rate,defensive_work_rate,crossing,...,vision,penalties,marking,standing_tackle,sliding_tackle,gk_diving,gk_handling,gk_kicking,gk_positioning,gk_reflexes
0,1,218353,505942,2016-02-18 00:00:00,67,71,right,medium,medium,49,...,54,48,65,69,69,6,11,10,8,8
1,2,218353,505942,2015-11-19 00:00:00,67,71,right,medium,medium,49,...,54,48,65,69,69,6,11,10,8,8
2,3,218353,505942,2015-09-21 00:00:00,62,66,right,medium,medium,49,...,54,48,65,66,69,6,11,10,8,8
3,4,218353,505942,2015-03-20 00:00:00,61,65,right,medium,medium,48,...,53,47,62,63,66,5,10,9,7,7
4,5,218353,505942,2007-02-22 00:00:00,61,65,right,medium,medium,48,...,53,47,62,63,66,5,10,9,7,7

In [20]:
sql_query= '''
            SELECT * FROM Player
            LIMIT 5;
           '''
pd.read_sql_query(sql_query, conn)

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187
1,2,155782,Aaron Cresswell,189615,1989-12-15 00:00:00,170.18,146
2,3,162549,Aaron Doran,186170,1991-05-13 00:00:00,170.18,163
3,4,30572,Aaron Galindo,140161,1982-05-08 00:00:00,182.88,198
4,5,23780,Aaron Hughes,17725,1979-11-08 00:00:00,182.88,154

In [23]:
sql_query= '''
            SELECT * FROM Match;
           '''
df_match = pd.read_sql_query(sql_query, conn)

In [39]:
df_match.head().iloc[:,1:20]

,country_id,league_id,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,away_team_goal,home_player_X1,home_player_X2,home_player_X3,home_player_X4,home_player_X5,home_player_X6,home_player_X7,home_player_X8,home_player_X9
0,1,1,2008/2009,1,2008-08-17 00:00:00,492473,9987,9993,1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,2008/2009,1,2008-08-16 00:00:00,492474,10000,9994,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1,1,2008/2009,1,2008-08-16 00:00:00,492475,9984,8635,0,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1,1,2008/2009,1,2008-08-17 00:00:00,492476,9991,9998,5,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1,1,2008/2009,1,2008-08-16 00:00:00,492477,7947,9985,1,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [22]:
sql_query= '''
            SELECT * FROM Team
            LIMIT 5;
           '''
pd.read_sql_query(sql_query, conn)

   id  team_api_id  team_fifa_api_id     team_long_name team_short_name
0   1         9987               673           KRC Genk             GEN
1   2         9993               675       Beerschot AC             BAC
2   3        10000             15005   SV Zulte-Waregem             ZUL
3   4         9994              2007   Sporting Lokeren             LOK
4   5         9984              1750  KSV Cercle Brugge             CEB

1. Which team scored the most points when playing at home?

In [32]:
sql_query= '''
            SELECT team_long_name, SUM(home_team_goal) total_points
            FROM Team t JOIN Match m 
            ON t.team_api_id = m.home_team_api_id
            GROUP BY 1
            ORDER BY 2 DESC
            LIMIT 1;
           '''
pd.read_sql_query(sql_query, conn)

   team_long_name  total_points
0  Real Madrid CF           505

2. Did this team also score the most points when playing away?

In [33]:
sql_query= '''
            SELECT team_long_name, SUM(away_team_goal) total_points
            FROM Team t JOIN Match m 
            ON t.team_api_id = m.away_team_api_id
            GROUP BY 1
            ORDER BY 2 DESC
            LIMIT 1;
           '''
pd.read_sql_query(sql_query, conn)

  team_long_name  total_points
0   FC Barcelona           354

Real Madrid CF does not score the most points when playing away.

3. How many matches resulted in a tie?

In [41]:
sql_query= '''
            SELECT COUNT(match_api_id) tie_matches
            FROM Match  
            WHERE home_team_goal = away_team_goal;
           '''
pd.read_sql_query(sql_query, conn)

   tie_matches
0         6596

4. How many players have Smith for their last name? How many have 'smith' anywhere in their name?

In [44]:
sql_query= '''
            SELECT COUNT(player_api_id) Smith_last_name
            FROM Player  
            WHERE player_name LIKE "% Smith";
           '''
pd.read_sql_query(sql_query, conn)

   Smith_last_name
0               15

In [45]:
sql_query= '''
            SELECT COUNT(player_api_id) smith_in_name
            FROM Player  
            WHERE player_name LIKE "%smith%";
           '''
pd.read_sql_query(sql_query, conn)

   smith_in_name
0             18

5. What was the median tie score? Use the value determined in the previous question for the number of tie games. *Hint:* PostgreSQL does not have a median function. Instead, think about the steps required to calculate a median and use the [`WITH`](https://www.postgresql.org/docs/8.4/static/queries-with.html) command to store stepwise results as a table and then operate on these results.

In [47]:
sql_query= '''
            WITH tie_matches as 
            (SELECT *
            FROM Match  
            WHERE home_team_goal = away_team_goal)
            
            SELECT AVG(home_team_goal) median
            FROM (SELECT home_team_goal 
                    FROM tie_matches
                    ORDER BY home_team_goal
                    LIMIT 2 - (SELECT COUNT(*) FROM tie_matches) % 2    -- odd 1, even 2
                    OFFSET (SELECT (COUNT(*) - 1) / 2
                    FROM tie_matches)) ;
           '''
pd.read_sql_query(sql_query, conn)

   median
0     1.0

6. What percentage of players prefer their left or right foot? *Hint:* Calculate either the right or left foot, whichever is easier based on how you setup the problem.

In [58]:
sql_query= '''
            SELECT COUNT(DISTINCT player_api_id)*100.0/(SELECT COUNT(DISTINCT player_api_id)
            FROM Player_Attributes) AS left_percentage
            FROM Player_Attributes  
            WHERE preferred_foot = 'left';
           '''

pd.read_sql_query(sql_query, conn)

   left_percentage
0        28.951175